app/controllers/wikis_controller.rb

  def show
    @wiki = Wiki.find(params[:id])
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @wiki = Wiki.find(params[:id])
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 3]]

  def create
     @wiki = Wiki.new(wiki_params)
     @wiki.user = current_user



     if @wiki.save
---
INSERT INTO "wikis" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "asdfa"], ["body", "asdfasdf"], ["created_at", "2016-05-26 06:51:34.025924"], ["updated_at", "2016-05-26 06:51:34.025924"]]

  def update
    @wiki = Wiki.find(params[:id])
    @wiki.assign_attributes(wiki_params)

    if @wiki.save
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "wikis" SET "body" = ?, "updated_at" = ? WHERE "wikis"."id" = ?  [["body", "wiki wikiasdfasdf asdf "], ["updated_at", "2016-06-03 01:33:45.897239"], ["id", 8]]

  def destroy
      @wiki = Wiki.find(params[:id])

    if @wiki.destroy
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "wikis" WHERE "wikis"."id" = ?  [["id", 2]]